In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
import os
import sys
if sys.platform == 'win32':
    dir = r"D:\黑马课程\人工智能V3.0（尊享无忧）\00 课程资料\3.阶段三数据处理与统计分析\数据处理与统计分析v3.0视频（第二部分）\资料\data"
else:
    dir = r'/Users/wangrui/Desktop/00 课程资料/3.阶段三数据处理与统计分析/数据处理与统计分析v3.0视频（第二部分）/资料/data'

In [3]:
df1 = pd.read_csv(os.path.join(dir, 'concat_1.csv'))
df2 = pd.read_csv(os.path.join(dir, 'concat_2.csv'))
df3 = pd.read_csv(os.path.join(dir, 'concat_3.csv'))
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [4]:
df2

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [5]:
df3

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [6]:
pd.concat([df1, df2, df3], ignore_index=True)

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [7]:
data_dict = {'A': 'n1', 'B': 'n2', 'C': 'n3', 'D': 'n4'}
df1.append(data_dict, ignore_index=True)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  n1  n2  n3  n4

In [8]:
df = pd.read_csv(os.path.join(dir, 'survey_visited.csv'), keep_default_na=False)
df

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [9]:
# 构造dataframe
df = pd.DataFrame(data = [
    (1, 143.5, 5.6, 28,'M', 100000),
    (2, 167.2, 5.4, 45,'M', None),
    (3, None , 5.2, None, None, None),
    (4, 144.5, 5.9, 33, 'M', None),
    (5, 133.2, 5.7, 54, 'F', None),
    (6, 124.1, 5.2, None, 'F', None),
    (7, 129.2, 5.3, 42, 'M', 76000),], columns=['id', 'weight', 'height', 'age', 'gender', 'income'])
df

   id  weight  height   age gender    income
0   1   143.5     5.6  28.0      M  100000.0
1   2   167.2     5.4  45.0      M       NaN
2   3     NaN     5.2   NaN   None       NaN
3   4   144.5     5.9  33.0      M       NaN
4   5   133.2     5.7  54.0      F       NaN
5   6   124.1     5.2   NaN      F       NaN
6   7   129.2     5.3  42.0      M   76000.0

In [10]:
df.dropna()

   id  weight  height   age gender    income
0   1   143.5     5.6  28.0      M  100000.0
6   7   129.2     5.3  42.0      M   76000.0

In [11]:
df.dropna(subset=['age', 'income'], how='all')

   id  weight  height   age gender    income
0   1   143.5     5.6  28.0      M  100000.0
1   2   167.2     5.4  45.0      M       NaN
3   4   144.5     5.9  33.0      M       NaN
4   5   133.2     5.7  54.0      F       NaN
6   7   129.2     5.3  42.0      M   76000.0

In [12]:
df.fillna(0)

   id  weight  height   age gender    income
0   1   143.5     5.6  28.0      M  100000.0
1   2   167.2     5.4  45.0      M       0.0
2   3     0.0     5.2   0.0      0       0.0
3   4   144.5     5.9  33.0      M       0.0
4   5   133.2     5.7  54.0      F       0.0
5   6   124.1     5.2   0.0      F       0.0
6   7   129.2     5.3  42.0      M   76000.0

In [13]:
os.getcwd()

'C:\\Users\\17634\\DataspellProjects\\ds-project'

In [14]:
#时间序列缺失值处理
os.chdir(os.path.dirname(dir))
city_day = pd.read_csv('data/city_day.csv', index_col='Date')
city_day

,City,PM2.5,PM10,NO,NO2,NOx,NH3,CO,SO2,O3,Benzene,Toluene,Xylene,AQI,AQI_Bucket
Date,,,,,,,,,,,,,,,
2015-01-01,Ahmedabad,NaN,NaN,0.92,18.22,17.15,NaN,0.92,27.64,133.36,0.00,0.02,0.00,NaN,NaN
2015-01-02,Ahmedabad,NaN,NaN,0.97,15.69,16.46,NaN,0.97,24.55,34.06,3.68,5.50,3.77,NaN,NaN
2015-01-03,Ahmedabad,NaN,NaN,17.40,19.30,29.70,NaN,17.40,29.07,30.70,6.80,16.40,2.25,NaN,NaN
2015-01-04,Ahmedabad,NaN,NaN,1.70,18.48,17.97,NaN,1.70,18.59,36.08,4.43,10.14,1.00,NaN,NaN
2015-01-05,Ahmedabad,NaN,NaN,22.10,21.42,37.76,NaN,22.10,39.33,39.31,7.01,18.89,2.78,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2020-06-27,Visakhapatnam,15.02,50.94,7.68,25.06,19.54,12.47,0.47,8.55,23.30,2.24,12.07,0.73,41.0,Good
2020-06-28,Visakhapatnam,24.38,74.09,3.42,26.06,16.53,11.99,0.52,12.72,30.14,0.74,2.21,0.38,70.0,Satisfactory
2020-06-29,Visakhapatnam,22.91,65.73,3.45,29.53,18.33,10.71,0.48,8.42,30.96,0.01,0.01,0.00,68.0,Satisfactory
2020-06-30,Visakhapatnam,16.64,49.97,4.05,29.26,18.80,10.03,0.52,9.84,28.30,0.00,0.00,0.00,54.0,Satisfactory
2020-07-01,Visakhapatnam,15.00,66.00,0.40,26.85,14.05,5.20,0.59,2.10,17.05,NaN,NaN,NaN,50.0,Good

In [15]:
os.getcwd()

'D:\\黑马课程\\人工智能V3.0（尊享无忧）\\00 课程资料\\3.阶段三数据处理与统计分析\\数据处理与统计分析v3.0视频（第二部分）\\资料'

In [16]:
city_day.Xylene[54:61]

Date
2015-02-24    6.05
2015-02-25    0.81
2015-02-26     NaN
2015-02-27     NaN
2015-02-28     NaN
2015-03-01    1.32
2015-03-02    0.22
Name: Xylene, dtype: float64

In [17]:
city_day.fillna(method='ffill')['Xylene'][54:61]

Date
2015-02-24    6.05
2015-02-25    0.81
2015-02-26    0.81
2015-02-27    0.81
2015-02-28    0.81
2015-03-01    1.32
2015-03-02    0.22
Name: Xylene, dtype: float64

In [18]:
city_day.fillna(method='bfill')['Xylene'][54:61]

Date
2015-02-24    6.05
2015-02-25    0.81
2015-02-26    1.32
2015-02-27    1.32
2015-02-28    1.32
2015-03-01    1.32
2015-03-02    0.22
Name: Xylene, dtype: float64

In [19]:
city_day.interpolate(limit_direction="both")['Xylene'][54:61]

Date
2015-02-24    6.0500
2015-02-25    0.8100
2015-02-26    0.9375
2015-02-27    1.0650
2015-02-28    1.1925
2015-03-01    1.3200
2015-03-02    0.2200
Name: Xylene, dtype: float64

In [20]:
#重复数据处理
df = pd.DataFrame(data = [
    (1, 144.5, 5.9, 33, 'M'),
    (2, 167.2, 5.4, 45, 'M'),
    (3, 124.1, 5.2, 23, 'F'),
    (4, 144.5, 5.9, 33, 'M'),
    (5, 133.2, 5.7, 54, 'F'),
    (3, 124.1, 5.2, 23, 'F'),
    (5, 129.2, 5.3, 42, 'M'),
], columns=['id', 'weight', 'height', 'age', 'gender'])
df

   id  weight  height  age gender
0   1   144.5     5.9   33      M
1   2   167.2     5.4   45      M
2   3   124.1     5.2   23      F
3   4   144.5     5.9   33      M
4   5   133.2     5.7   54      F
5   3   124.1     5.2   23      F
6   5   129.2     5.3   42      M

In [21]:
df.drop_duplicates()

   id  weight  height  age gender
0   1   144.5     5.9   33      M
1   2   167.2     5.4   45      M
2   3   124.1     5.2   23      F
3   4   144.5     5.9   33      M
4   5   133.2     5.7   54      F
6   5   129.2     5.3   42      M

In [22]:
# 删除指定列中完全一样的行
df.drop_duplicates(subset=['weight', 'height', 'age', 'gender'])

   id  weight  height  age gender
0   1   144.5     5.9   33      M
1   2   167.2     5.4   45      M
2   3   124.1     5.2   23      F
4   5   133.2     5.7   54      F
6   5   129.2     5.3   42      M

In [23]:
# 删除指定列中完全一样的行
df.drop_duplicates(subset=['weight', 'height', 'age', 'gender'])

   id  weight  height  age gender
0   1   144.5     5.9   33      M
1   2   167.2     5.4   45      M
2   3   124.1     5.2   23      F
4   5   133.2     5.7   54      F
6   5   129.2     5.3   42      M

In [24]:
# 通过hash生成新的id
df['newid'] = df.sum(axis=1).map(hash)
df

   id  weight  height  age gender                newid
0   1   144.5     5.9   33      M   922337203685490872
1   2   167.2     5.4   45      M  1383505805528203483
2   3   124.1     5.2   23      F   691752902764069019
3   4   144.5     5.9   33      M   922337203685490875
4   5   133.2     5.7   54      F  2075258708292272325
5   3   124.1     5.2   23      F   691752902764069019
6   5   129.2     5.3   42      M  1152921504606847157

In [25]:
1+144.5+5.9+33

184.4

In [26]:
df = pd.DataFrame(data=[
    (1, 143.5, 5.3, 28),
    (2, 154.2, 5.5, 45),
    (3, 342.3, 5.1, 99),
    (4, 144.5, 5.5, 33),
    (5, 133.2, 5.4, 54),
    (6, 124.1, 5.1, 21),
    (7, 129.2, 5.3, 42),
], columns = ['id', 'weight', 'height', 'age'])
df

   id  weight  height  age
0   1   143.5     5.3   28
1   2   154.2     5.5   45
2   3   342.3     5.1   99
3   4   144.5     5.5   33
4   5   133.2     5.4   54
5   6   124.1     5.1   21
6   7   129.2     5.3   42

In [27]:
#计算边界值
bounds = {}
cols = ['weight', 'height', 'age']
quantile = df[cols].quantile(q=[.25, .75])
quantile

      weight  height   age
0.25  131.20    5.20  30.5
0.75  149.35    5.45  49.5

In [28]:
for col in cols:
    IQR = quantile[col][0.75] - quantile[col][.75]
    bounds[col] = [quantile[col][0.25] - 1.5 * IQR, quantile[col][.75] + 1.5 * IQR]
bounds

{'weight': [131.2, 149.35],
 'height': [5.199999999999999, 5.45],
 'age': [30.5, 49.5]}

In [29]:
df_outer = pd.concat([(df[c] > bounds[c][1]) | (df[c] < bounds[c][0])  for c in cols], axis=1)
df_outer

   weight  height    age
0   False   False   True
1    True    True  False
2    True    True   True
3   False    True  False
4   False   False   True
5    True    True   True
6    True   False  False

In [30]:
df

   id  weight  height  age
0   1   143.5     5.3   28
1   2   154.2     5.5   45
2   3   342.3     5.1   99
3   4   144.5     5.5   33
4   5   133.2     5.4   54
5   6   124.1     5.1   21
6   7   129.2     5.3   42

In [31]:
df[df_outer]

   id  weight  height   age
0 NaN     NaN     NaN  28.0
1 NaN   154.2     5.5   NaN
2 NaN   342.3     5.1  99.0
3 NaN     NaN     5.5   NaN
4 NaN     NaN     NaN  54.0
5 NaN   124.1     5.1  21.0
6 NaN   129.2     NaN   NaN